app/controllers/trivia_items_controller.rb

  def ajaxsearch
    if(params[:city]=='false')
      @trivia_items = Trivia.select('DISTINCT trim(city) as city, state').where("state = ?", params[:state])
      @markers = '['
      @trivia_items.group_by(&:location_string).each do |location, trivia_items|
        trivia_items.each do |trivia_item|
          if(trivia_item.trivia_count>=1 && trivia_item.trivia_count <=2)
            marker_image = '/images/pin_3.png'
          elsif(trivia_item.trivia_count>2 && trivia_item.trivia_count<=5)
            marker_image = '/images/pin_2.png'
          else
            marker_image = '/images/pin_1.png'
          end
          @markers+="{\"address\":\""+trivia_item.city.tr("\"","\'")+" ,"+trivia_item.state+" ,"+trivia_item.country+"\", \"data\":{\"city\":\""+trivia_item.city.tr("\"","\'")+"\", \"state\":\""+trivia_item.state+"\", \"trivia\":\"#{trivia_item.trivia_count.to_s}\"}, \"options\":{\"icon\":\"#{marker_image}\"} }, "
---
SELECT DISTINCT trim(city) as city, state FROM "trivia" WHERE (state = 'MN')
SELECT "trivia".* FROM "trivia" WHERE (city = 'Anaheim' AND state = 'CA')
SELECT COUNT("trivia"."id") FROM "trivia" WHERE (city = 'Shafer' ) AND (state = 'MN' )